; domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;; DOMAIN: Project_TER
;;
;; Description:
;; This domain models a logistics terminal (TER) where packages are processed
;; through several warehouse stages before shipment.
;;
;; The domain supports two types of package flows:
;;
;; 1. Standard Packages
;;    Unload -> Storage -> Preparation -> Control -> Loading
;;
;; 2. Mixed Packages
;;    Unload -> Split Mixed Palette -> Storage -> Preparation
;;    -> Control -> Loading
;;
;; Mixed palettes contain multiple product categories and must be split into
;; standard packages before continuing through the normal workflow.
;;
;; Workers are responsible for transporting packages between connected
;; warehouse locations.
;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (domain Project_TER)

    (:requirements :strips :typing :negative-preconditions)

    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    ;; TYPES
    ;;
    ;; loc
    ;;     Warehouse locations and operational areas.
    ;;
    ;; worker
    ;;     Employee responsible for handling packages.
    ;;
    ;; package
    ;;     Generic package type.
    ;;
    ;; mono
    ;;     Single-product package.
    ;;
    ;; mixed
    ;;     Mixed palette containing multiple product categories.
    ;;     Must be split before storage.
    ;;
    ;; standard
    ;;     Standard package created after splitting a mixed palette.
    ;;
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

    (:types
        loc worker - object
        package - object
        mono mixed standard - package
    )

    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    ;; PREDICATES
    ;;
    ;; (on ?package ?location)
    ;;     Package is located at a specific location.
    ;;
    ;; (at ?worker ?location)
    ;;     Worker is located at a specific location.
    ;;
    ;; (arrived ?package)
    ;;     Package has entered the warehouse workflow.
    ;;
    ;; (prepared ?package)
    ;;     Package has completed preparation.
    ;;
    ;; (controlled ?package)
    ;;     Package has passed inspection.
    ;;
    ;; (loaded ?package)
    ;;     Package has been loaded for shipment.
    ;;
    ;; (connected ?location1 ?location2)
    ;;     Direct path exists between two locations.
    ;;
    ;; (is_mixed ?package)
    ;;     Package is identified as a mixed palette.
    ;;
    ;; (is_split ?mixed_package)
    ;;     Mixed palette has already been separated.
    ;;
    ;; (processed ?mixed_package)
    ;;     Splitting process has been completed.
    ;;
    ;; Zone predicates define warehouse roles.
    ;;
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

    (:predicates

        ;; Package location
        (on ?y - package ?l - loc)

        ;; Worker location
        (at ?w - worker ?l - loc)

        ;; Package status
        (arrived ?y - package)
        (prepared ?y - package)
        (controlled ?y - package)
        (loaded ?y - package)

        ;; Navigation
        (connected ?l1 - loc ?l2 - loc)

        ;; Mixed package management
        (is_mixed ?y - package)
        (is_split ?y - mixed)
        (processed ?y - mixed)

        ;; Warehouse zones
        (is_arrival_zone ?l - loc)
        (is_storage_zone ?l - loc)
        (is_prep_zone ?l - loc)
        (is_control_zone ?l - loc)
        (is_shipping_dock ?l - loc)
    )

    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    ;; ACTION: worker_travel
    ;;
    ;; Purpose:
    ;;     Move a worker between two connected locations.
    ;;
    ;; Preconditions:
    ;;     - Worker is at the source location.
    ;;     - Source and destination are connected.
    ;;
    ;; Effects:
    ;;     - Worker leaves source location.
    ;;     - Worker arrives at destination.
    ;;
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

    (:action worker_travel
        :parameters (?w - worker ?from - loc ?to - loc)

        :precondition
            (and
                (at ?w ?from)
                (connected ?from ?to)
            )

        :effect
            (and
                (not (at ?w ?from))
                (at ?w ?to)
            )
    )

    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    ;; ACTION: unload
    ;;
    ;; Purpose:
    ;;     Receive a package into the warehouse.
    ;;
    ;; Preconditions:
    ;;     - Worker and package are together.
    ;;     - Package has not already arrived.
    ;;     - Destination is an arrival zone.
    ;;     - Locations are connected.
    ;;
    ;; Effects:
    ;;     - Package enters the warehouse system.
    ;;     - Package becomes marked as arrived.
    ;;     - Worker moves with the package.
    ;;
    ;; Workflow Stage:
    ;;     First stage of processing.
    ;;
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

    (:action unload
        :parameters (?w - worker ?y - package ?from - loc ?to - loc)

        :precondition
            (and
                (at ?w ?from)
                (on ?y ?from)
                (not (arrived ?y))
                (is_arrival_zone ?to)
                (connected ?from ?to)
            )

        :effect
            (and
                (not (on ?y ?from))
                (on ?y ?to)

                (not (at ?w ?from))
                (at ?w ?to)

                (arrived ?y)
            )
    )

    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    ;; ACTION: split_mixed_palette
    ;;
    ;; Purpose:
    ;;     Split a mixed palette into standard palettes.
    ;;
    ;; Business Rule:
    ;;     Mixed palettes cannot enter storage directly.
    ;;     They must first be separated into standard packages.
    ;;
    ;; Preconditions:
    ;;     - Worker is present.
    ;;     - Mixed palette is in an arrival zone.
    ;;     - Mixed palette has arrived.
    ;;     - Mixed palette has not already been split.
    ;;
    ;; Effects:
    ;;     - Mixed palette is marked as split.
    ;;     - Mixed palette is marked as processed.
    ;;     - Original mixed palette disappears.
    ;;     - Two standard packages are created.
    ;;     - New packages inherit the arrived status.
    ;;
    ;; Workflow Stage:
    ;;     Optional stage for mixed palettes only.
    ;;
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

    (:action split_mixed_palette
        :parameters (?w - worker ?ymix - mixed ?y1 - standard ?y2 - standard ?l - loc)

        :precondition
            (and
                (at ?w ?l)
                (is_arrival_zone ?l)
                (on ?ymix ?l)
                (arrived ?ymix)
                (not (is_split ?ymix))
            )

        :effect
            (and
                (is_split ?ymix)
                (processed ?ymix)

                (not (on ?ymix ?l))

                (on ?y1 ?l)
                (arrived ?y1)

                (on ?y2 ?l)
                (arrived ?y2)
            )
    )

    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    ;; ACTION: stockage
    ;;
    ;; Purpose:
    ;;     Move a package into storage.
    ;;
    ;; Business Rule:
    ;;     Mixed palettes cannot be stored directly.
    ;;     Only standard packages may enter storage.
    ;;
    ;; Preconditions:
    ;;     - Package has arrived.
    ;;     - Package is not mixed.
    ;;     - Package has not been prepared.
    ;;     - Destination is a storage zone.
    ;;
    ;; Effects:
    ;;     - Package is moved to storage.
    ;;     - Worker moves with the package.
    ;;
    ;; Workflow Stage:
    ;;     Storage stage.
    ;;
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

    (:action stockage
        :parameters (?w - worker ?y - package ?from - loc ?to - loc)

        :precondition
            (and
                (at ?w ?from)
                (on ?y ?from)

                (arrived ?y)
                (not (is_mixed ?y))
                (not (prepared ?y))

                (is_storage_zone ?to)
                (connected ?from ?to)
            )

        :effect
            (and
                (not (on ?y ?from))
                (on ?y ?to)

                (not (at ?w ?from))
                (at ?w ?to)
            )
    )

    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    ;; ACTION: prepare_command
    ;;
    ;; Purpose:
    ;;     Prepare a package for shipment.
    ;;
    ;; Preconditions:
    ;;     - Worker and package are together.
    ;;     - Package has not already been controlled.
    ;;     - Destination is a preparation zone.
    ;;
    ;; Effects:
    ;;     - Package becomes prepared.
    ;;     - Package is moved to preparation area.
    ;;     - Worker moves with package.
    ;;
    ;; Workflow Stage:
    ;;     Preparation stage.
    ;;
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

    (:action prepare_command
        :parameters (?w - worker ?y - package ?from - loc ?to - loc)

        :precondition
            (and
                (at ?w ?from)
                (on ?y ?from)

                (not (controlled ?y))

                (is_prep_zone ?to)
                (connected ?from ?to)
            )

        :effect
            (and
                (not (on ?y ?from))
                (on ?y ?to)

                (not (at ?w ?from))
                (at ?w ?to)

                (prepared ?y)
            )
    )

    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    ;; ACTION: control_check
    ;;
    ;; Purpose:
    ;;     Inspect and validate a prepared package.
    ;;
    ;; Preconditions:
    ;;     - Package is prepared.
    ;;     - Package has not already been loaded.
    ;;     - Destination is a control zone.
    ;;
    ;; Effects:
    ;;     - Package passes inspection.
    ;;     - Package becomes controlled.
    ;;     - Worker moves with package.
    ;;
    ;; Workflow Stage:
    ;;     Quality-control stage.
    ;;
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

    (:action control_check
        :parameters (?w - worker ?y - package ?from - loc ?to - loc)

        :precondition
            (and
                (at ?w ?from)
                (on ?y ?from)

                (prepared ?y)
                (not (loaded ?y))

                (is_control_zone ?to)
                (connected ?from ?to)
            )

        :effect
            (and
                (not (on ?y ?from))
                (on ?y ?to)

                (not (at ?w ?from))
                (at ?w ?to)

                (controlled ?y)
            )
    )

    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    ;; ACTION: load_truck
    ;;
    ;; Purpose:
    ;;     Load a validated package onto an outgoing shipment location.
    ;;
    ;; Preconditions:
    ;;     - Package has passed control.
    ;;     - Destination is a shipping dock.
    ;;
    ;; Effects:
    ;;     - Package becomes loaded.
    ;;     - Package reaches final shipment stage.
    ;;     - Worker moves with package.
    ;;
    ;; Workflow Stage:
    ;;     Final stage of the process.
    ;;
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

    (:action load_truck
        :parameters (?w - worker ?y - package ?from - loc ?to - loc)

        :precondition
            (and
                (at ?w ?from)
                (on ?y ?from)

                (controlled ?y)

                (is_shipping_dock ?to)
                (connected ?from ?to)
            )

        :effect
            (and
                (not (on ?y ?from))
                (on ?y ?to)

                (not (at ?w ?from))
                (at ?w ?to)

                (loaded ?y)
            )
    )
)

; problem
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;; PROBLEM: test_volume
;;
;; Description:
;; This problem models a warehouse processing scenario involving both
;; standard packages and a mixed palette.
;;
;; Initial inventory:
;;   - 2 mono packages (m1, m2)
;;   - 1 mixed palette (mix1)
;;
;; Business workflow:
;;
;; Mono Packages:
;;     Unload
;;         ↓
;;     Storage
;;         ↓
;;     Preparation
;;         ↓
;;     Control
;;         ↓
;;     Loading
;;
;; Mixed Palette:
;;     Unload
;;         ↓
;;     Split into v1 and v2
;;         ↓
;;     Storage
;;         ↓
;;     Preparation
;;         ↓
;;     Control
;;         ↓
;;     Loading
;;
;; Goal:
;;   - Both mono packages must be loaded.
;;   - The mixed palette must be processed (split).
;;   - The resulting standard packages (v1 and v2) must be loaded.
;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (problem test_volume)

    (:domain Project_TER)

    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    ;; OBJECTS
    ;;
    ;; LOCATIONS
    ;;
    ;; truck_dock      : Incoming truck location.
    ;; arrival_zone    : Receiving/unloading area.
    ;; rack_storage    : Storage area.
    ;; prep_zone       : Package preparation area.
    ;; control_zone    : Inspection and quality-control area.
    ;; shipping_dock   : Outgoing shipping location.
    ;;
    ;; WORKER
    ;;
    ;; cariste1        : Warehouse operator responsible for moving packages.
    ;;
    ;; MONO PACKAGES
    ;;
    ;; m1, m2          : Standard mono-product packages.
    ;;
    ;; MIXED PACKAGE
    ;;
    ;; mix1            : Mixed palette that must be split.
    ;;
    ;; STANDARD PACKAGES
    ;;
    ;; v1, v2          : Packages created after splitting mix1.
    ;;
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

    (:objects

        ;; Warehouse locations
        truck_dock
        arrival_zone
        rack_storage
        prep_zone
        control_zone
        shipping_dock - loc

        ;; Worker
        cariste1 - worker

        ;; Mono packages
        m1
        m2 - mono

        ;; Mixed palette
        mix1 - mixed

        ;; Standard packages created after splitting
        v1
        v2 - standard
    )

    (:init

        ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
        ;; INITIAL WORKER POSITION
        ;;
        ;; The worker starts at the truck dock where incoming
        ;; packages are located.
        ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

        (at cariste1 truck_dock)

        ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
        ;; WAREHOUSE LAYOUT
        ;;
        ;; Locations are connected in both directions so that
        ;; the worker can move forward with packages and return
        ;; empty when necessary.
        ;;
        ;; Layout:
        ;;
        ;; truck_dock
        ;;      |
        ;; arrival_zone
        ;;      |
        ;; rack_storage
        ;;      |
        ;; prep_zone
        ;;      |
        ;; control_zone
        ;;      |
        ;; shipping_dock
        ;;
        ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

        (connected truck_dock arrival_zone)
        (connected arrival_zone truck_dock)

        (connected arrival_zone rack_storage)
        (connected rack_storage arrival_zone)

        (connected rack_storage prep_zone)
        (connected prep_zone rack_storage)

        (connected prep_zone control_zone)
        (connected control_zone prep_zone)

        (connected control_zone shipping_dock)
        (connected shipping_dock control_zone)

        ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
        ;; ZONE DEFINITIONS
        ;;
        ;; Assigns operational roles to warehouse locations.
        ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

        (is_arrival_zone arrival_zone)

        (is_storage_zone rack_storage)

        (is_prep_zone prep_zone)

        (is_control_zone control_zone)

        (is_shipping_dock shipping_dock)

        ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
        ;; INITIAL PACKAGE LOCATIONS
        ;;
        ;; All packages start inside the incoming truck area.
        ;;
        ;; m1 and m2 are mono packages.
        ;; mix1 is a mixed palette that must be split before
        ;; entering storage.
        ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

        (on m1 truck_dock)
        (on m2 truck_dock)
        (on mix1 truck_dock)

        ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
        ;; PACKAGE CLASSIFICATION
        ;;
        ;; Identifies mix1 as a mixed palette.
        ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

        (is_mixed mix1)
    )

    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    ;; GOAL STATE
    ;;
    ;; Success conditions:
    ;;
    ;; 1. Mono package m1 must be loaded.
    ;; 2. Mono package m2 must be loaded.
    ;; 3. Mixed palette mix1 must have been processed (split).
    ;; 4. Standard package v1 must be loaded.
    ;; 5. Standard package v2 must be loaded.
    ;;
    ;; This ensures that all incoming goods have completed the
    ;; warehouse workflow and are ready for shipment.
    ;;
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

    (:goal
        (and

            ;; Mono packages shipped
            (loaded m1)
            (loaded m2)

            ;; Mixed palette processed
            (processed mix1)

            ;; Generated packages shipped
            (loaded v1)
            (loaded v2)
        )
    )
)

; plan
1. (unload cariste1 m2 truck_dock arrival_zone)
   deleted: (on m2 truck_dock) (at cariste1 truck_dock)
   added: (on m2 arrival_zone) (at cariste1 arrival_zone) (arrived m2)
   goals met: 0 of 5
2. (stockage cariste1 m2 arrival_zone rack_storage)
   deleted: (on m2 arrival_zone) (at cariste1 arrival_zone)
   added: (on m2 rack_storage) (at cariste1 rack_storage)
   goals met: 0 of 5
3. (worker_travel cariste1 rack_storage arrival_zone)
   deleted: (at cariste1 rack_storage)
   added: (at cariste1 arrival_zone)
   goals met: 0 of 5
4. (worker_travel cariste1 arrival_zone truck_dock)
   deleted: (at cariste1 arrival_zone)
   added: (at cariste1 truck_dock)
   goals met: 0 of 5
5. (unload cariste1 m1 truck_dock arrival_zone)
   deleted: (on m1 truck_dock) (at cariste1 truck_dock)
   added: (on m1 arrival_zone) (at cariste1 arrival_zone) (arrived m1)
   goals met: 0 of 5
6. (worker_travel cariste1 arrival_zone rack_storage)
   deleted: (at cariste1 arrival_zone)
   added: (at cariste1 rack_storage)
   goals met: 0 of 5
7. (prepare_command cariste1 m2 rack_storage prep_zone)
   deleted: (on m2 rack_storage) (at cariste1 rack_storage)
   added: (on m2 prep_zone) (at cariste1 prep_zone) (prepared m2)
   goals met: 0 of 5
8. (control_check cariste1 m2 prep_zone control_zone)
   deleted: (on m2 prep_zone) (at cariste1 prep_zone)
   added: (on m2 control_zone) (at cariste1 control_zone) (controlled m2)
   goals met: 0 of 5
9. (load_truck cariste1 m2 control_zone shipping_dock)
   deleted: (on m2 control_zone) (at cariste1 control_zone)
   added: (on m2 shipping_dock) (at cariste1 shipping_dock) (loaded m2)
   goals met: 1 of 5
10. (worker_travel cariste1 shipping_dock control_zone)
   deleted: (at cariste1 shipping_dock)
   added: (at cariste1 control_zone)
   goals met: 1 of 5
11. (worker_travel cariste1 control_zone prep_zone)
   deleted: (at cariste1 control_zone)
   added: (at cariste1 prep_zone)
   goals met: 1 of 5
12. (worker_travel cariste1 prep_zone rack_storage)
   deleted: (at cariste1 prep_zone)
   added: (at cariste1 rack_storage)
   goals met: 1 of 5
13. (worker_travel cariste1 rack_storage arrival_zone)
   deleted: (at cariste1 rack_storage)
   added: (at cariste1 arrival_zone)
   goals met: 1 of 5
14. (worker_travel cariste1 arrival_zone truck_dock)
   deleted: (at cariste1 arrival_zone)
   added: (at cariste1 truck_dock)
   goals met: 1 of 5
15. (unload cariste1 mix1 truck_dock arrival_zone)
   deleted: (on mix1 truck_dock) (at cariste1 truck_dock)
   added: (on mix1 arrival_zone) (at cariste1 arrival_zone) (arrived mix1)
   goals met: 1 of 5
16. (split_mixed_palette cariste1 mix1 v1 v2 arrival_zone)
   deleted: (on mix1 arrival_zone)
   added: (is_split mix1) (processed mix1) (on v1 arrival_zone) (arrived v1) (on v2 arrival_zone) (arrived v2)
   goals met: 2 of 5
17. (stockage cariste1 v2 arrival_zone rack_storage)
   deleted: (on v2 arrival_zone) (at cariste1 arrival_zone)
   added: (on v2 rack_storage) (at cariste1 rack_storage)
   goals met: 2 of 5
18. (worker_travel cariste1 rack_storage arrival_zone)
   deleted: (at cariste1 rack_storage)
   added: (at cariste1 arrival_zone)
   goals met: 2 of 5
19. (stockage cariste1 v1 arrival_zone rack_storage)
   deleted: (on v1 arrival_zone) (at cariste1 arrival_zone)
   added: (on v1 rack_storage) (at cariste1 rack_storage)
   goals met: 2 of 5
20. (prepare_command cariste1 v1 rack_storage prep_zone)
   deleted: (on v1 rack_storage) (at cariste1 rack_storage)
   added: (on v1 prep_zone) (at cariste1 prep_zone) (prepared v1)
   goals met: 2 of 5
21. (control_check cariste1 v1 prep_zone control_zone)
   deleted: (on v1 prep_zone) (at cariste1 prep_zone)
   added: (on v1 control_zone) (at cariste1 control_zone) (controlled v1)
   goals met: 2 of 5
22. (worker_travel cariste1 control_zone prep_zone)
   deleted: (at cariste1 control_zone)
   added: (at cariste1 prep_zone)
   goals met: 2 of 5
23. (worker_travel cariste1 prep_zone rack_storage)
   deleted: (at cariste1 prep_zone)
   added: (at cariste1 rack_storage)
   goals met: 2 of 5
24. (prepare_command cariste1 v2 rack_storage prep_zone)
   deleted: (on v2 rack_storage) (at cariste1 rack_storage)
   added: (on v2 prep_zone) (at cariste1 prep_zone) (prepared v2)
   goals met: 2 of 5
25. (control_check cariste1 v2 prep_zone control_zone)
   deleted: (on v2 prep_zone) (at cariste1 prep_zone)
   added: (on v2 control_zone) (at cariste1 control_zone) (controlled v2)
   goals met: 2 of 5
26. (load_truck cariste1 v1 control_zone shipping_dock)
   deleted: (on v1 control_zone) (at cariste1 control_zone)
   added: (on v1 shipping_dock) (at cariste1 shipping_dock) (loaded v1)
   goals met: 3 of 5
27. (worker_travel cariste1 shipping_dock control_zone)
   deleted: (at cariste1 shipping_dock)
   added: (at cariste1 control_zone)
   goals met: 3 of 5
28. (worker_travel cariste1 control_zone prep_zone)
   deleted: (at cariste1 control_zone)
   added: (at cariste1 prep_zone)
   goals met: 3 of 5
29. (worker_travel cariste1 prep_zone rack_storage)
   deleted: (at cariste1 prep_zone)
   added: (at cariste1 rack_storage)
   goals met: 3 of 5
30. (worker_travel cariste1 rack_storage arrival_zone)
   deleted: (at cariste1 rack_storage)
   added: (at cariste1 arrival_zone)
   goals met: 3 of 5
31. (stockage cariste1 m1 arrival_zone rack_storage)
   deleted: (on m1 arrival_zone) (at cariste1 arrival_zone)
   added: (on m1 rack_storage) (at cariste1 rack_storage)
   goals met: 3 of 5
32. (prepare_command cariste1 m1 rack_storage prep_zone)
   deleted: (on m1 rack_storage) (at cariste1 rack_storage)
   added: (on m1 prep_zone) (at cariste1 prep_zone) (prepared m1)
   goals met: 3 of 5
33. (control_check cariste1 m1 prep_zone control_zone)
   deleted: (on m1 prep_zone) (at cariste1 prep_zone)
   added: (on m1 control_zone) (at cariste1 control_zone) (controlled m1)
   goals met: 3 of 5
34. (load_truck cariste1 v2 control_zone shipping_dock)
   deleted: (on v2 control_zone) (at cariste1 control_zone)
   added: (on v2 shipping_dock) (at cariste1 shipping_dock) (loaded v2)
   goals met: 4 of 5
35. (worker_travel cariste1 shipping_dock control_zone)
   deleted: (at cariste1 shipping_dock)
   added: (at cariste1 control_zone)
   goals met: 4 of 5
36. (load_truck cariste1 m1 control_zone shipping_dock)
   deleted: (on m1 control_zone) (at cariste1 control_zone)
   added: (on m1 shipping_dock) (at cariste1 shipping_dock) (loaded m1)
   goals met: 5 of 5
